Any groupby operation involves one of the following operations on the original object. They are −

* Splitting the Object

* Applying a function

* Combining the results

In many situations, we split the data into sets and we apply some functionality on each subset. In the apply functionality, we can perform the following operations −

* Aggregation − computing a summary statistic

* Transformation − perform some group-specific operation

* Filtration − discarding the data with some condition

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [2]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [3]:
df.groupby('Company')

In [4]:
by_comp = df.groupby('Company')

In [5]:
by_comp.groups

{'FB': [4, 5], 'GOOG': [0, 1], 'MSFT': [2, 3]}

In [6]:
by_comp[['Sales']].sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [7]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [8]:
by_comp[['Sales']].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

#### select a group
Using the get_group() method, we can select a single group from our groupby object

In [9]:
by_comp.get_group('FB')

  Company Person  Sales
4      FB   Carl    243
5      FB  Sarah    350

In [10]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Applying functions

In [11]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
def doubler(x):
    return x*2

In [13]:
df2 = df.copy()

In [14]:
df2['Sales'] = df2['Sales'].apply(doubler)

In [15]:
df2

  Company   Person  Sales
0    GOOG      Sam    400
1    GOOG  Charlie    240
2    MSFT      Amy    680
3    MSFT  Vanessa    248
4      FB     Carl    486
5      FB    Sarah    700

In [16]:
df['Sales'].apply(lambda x: x*2)

0    400
1    240
2    680
3    248
4    486
5    700
Name: Sales, dtype: int64

# Analyse University Dataset

In [17]:
data = pd.read_csv('Datasets/college_data.csv')

C:\Users\Lawson\AppData\Local\Temp\ipykernel_17180\3112603597.py:1: DtypeWarning: Columns (10,11,12) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('Datasets/college_data.csv')

In [18]:
df = data.copy()

In [19]:
df.head()

,UNITID,INSTNM,CITY,STABBR,ZIP,REGION,PREDDEG,LOCALE,LATITUDE,LONGITUDE,...,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,UGDS_AIAN,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,year
0,100654,Alabama A & M University,Normal,AL,35762,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0402,0.0017,2001
1,100663,University of Alabama at Birmingham,Birmingham,AL,35294-0110,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0330,0.0255,2001
2,100706,University of Alabama in Huntsville,Huntsville,AL,35899,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0396,0.0000,2001
3,100751,The University of Alabama,Tuscaloosa,AL,35487-0100,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0159,0.0000,2001
4,100858,Auburn University,Auburn,AL,36849,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0084,0.0016,2001

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58123 entries, 0 to 58122
Data columns (total 33 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   UNITID                  58123 non-null  int64
 1   INSTNM                  58123 non-null  object
 2   CITY                    58123 non-null  object
 3   STABBR                  58123 non-null  object
 4   ZIP                     58123 non-null  object
 5   REGION                  58122 non-null  object
 6   PREDDEG                 58123 non-null  object
 7   LOCALE                  4110 non-null   float64
 8   LATITUDE                4110 non-null   float64
 9   LONGITUDE               4110 non-null   float64
 10  CCBASIC                 4110 non-null   object
 11  CCUGPROF                4110 non-null   object
 12  CCSIZSET                4110 non-null   object
 13  ADM_RATE_ALL            58123 non-null  float64
 14  PPTUG_EF                55491 non-null  float64
 15  SAT_AVG_ALL             32424 non-null  float64
 16  COSTT4_A                27970 non-null  float64
 17  CONTROL                 58119 non-null  object
 18  TUITIONFEE_IN           48634 non-null  float64
 19  TUITIONFEE_OUT          47855 non-null  float64
 20  MEDIAN_HH_INC           10650 non-null  float64
 21  MN_EARN_WNE_INDEP0_P10  12925 non-null  float64
 22  MN_EARN_WNE_INDEP1_P10  13088 non-null  float64
 23  UGDS_WHITE              34930 non-null  float64
 24  UGDS_BLACK              34930 non-null  float64
 25  UGDS_HISP               34930 non-null  float64
 26  UGDS_ASIAN              34930 non-null  float64
 27  UGDS_AIAN               34930 non-null  float64
 28  UGDS_NHPI               34930 non-null  float64
 29  UGDS_2MOR               34930 non-null  float64
 30  UGDS_NRA                55613 non-null  float64
 31  UGDS_UNKN               55613 non-null  float64
 32  year                    58123 non-null  int64
dtypes: float64(21), int64(2), object(10)
memory usage: 14.6+ MB

In [21]:
df.isnull().sum()

UNITID                        0
INSTNM                        0
CITY                          0
STABBR                        0
ZIP                           0
REGION                        1
PREDDEG                       0
LOCALE                    54013
LATITUDE                  54013
LONGITUDE                 54013
CCBASIC                   54013
CCUGPROF                  54013
CCSIZSET                  54013
ADM_RATE_ALL                  0
PPTUG_EF                   2632
SAT_AVG_ALL               25699
COSTT4_A                  30153
CONTROL                       4
TUITIONFEE_IN              9489
TUITIONFEE_OUT            10268
MEDIAN_HH_INC             47473
MN_EARN_WNE_INDEP0_P10    45198
MN_EARN_WNE_INDEP1_P10    45035
UGDS_WHITE                23193
UGDS_BLACK                23193
UGDS_HISP                 23193
UGDS_ASIAN                23193
UGDS_AIAN                 23193
UGDS_NHPI                 23193
UGDS_2MOR                 23193
UGDS_NRA                   2510
UGDS_UNKN                  2510
year                          0
dtype: int64

In [22]:
df.columns

Index(['UNITID', 'INSTNM', 'CITY', 'STABBR', 'ZIP', 'REGION', 'PREDDEG',
       'LOCALE', 'LATITUDE', 'LONGITUDE', 'CCBASIC', 'CCUGPROF', 'CCSIZSET',
       'ADM_RATE_ALL', 'PPTUG_EF', 'SAT_AVG_ALL', 'COSTT4_A', 'CONTROL',
       'TUITIONFEE_IN', 'TUITIONFEE_OUT', 'MEDIAN_HH_INC',
       'MN_EARN_WNE_INDEP0_P10', 'MN_EARN_WNE_INDEP1_P10', 'UGDS_WHITE',
       'UGDS_BLACK', 'UGDS_HISP', 'UGDS_ASIAN', 'UGDS_AIAN', 'UGDS_NHPI',
       'UGDS_2MOR', 'UGDS_NRA', 'UGDS_UNKN', 'year'],
      dtype='object')

In [23]:
drop_columns = ['LOCALE', 'LATITUDE', 'LONGITUDE', 'CCBASIC', 'CCUGPROF', 'CCSIZSET',
               'MEDIAN_HH_INC', 'MN_EARN_WNE_INDEP0_P10', 'MN_EARN_WNE_INDEP1_P10']

In [24]:
df2 = df.drop(drop_columns, axis=1)

In [25]:
df2.head()

,UNITID,INSTNM,CITY,STABBR,ZIP,REGION,PREDDEG,ADM_RATE_ALL,PPTUG_EF,SAT_AVG_ALL,...,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,UGDS_AIAN,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,year
0,100654,Alabama A & M University,Normal,AL,35762,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7505,0.0764,970.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0402,0.0017,2001
1,100663,University of Alabama at Birmingham,Birmingham,AL,35294-0110,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.9098,0.2801,1030.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0330,0.0255,2001
2,100706,University of Alabama in Huntsville,Huntsville,AL,35899,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.8381,0.2689,1109.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0396,0.0000,2001
3,100751,The University of Alabama,Tuscaloosa,AL,35487-0100,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7948,0.0982,1091.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0159,0.0000,2001
4,100858,Auburn University,Auburn,AL,36849,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7594,0.0906,1094.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0084,0.0016,2001

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58123 entries, 0 to 58122
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   UNITID          58123 non-null  int64
 1   INSTNM          58123 non-null  object
 2   CITY            58123 non-null  object
 3   STABBR          58123 non-null  object
 4   ZIP             58123 non-null  object
 5   REGION          58122 non-null  object
 6   PREDDEG         58123 non-null  object
 7   ADM_RATE_ALL    58123 non-null  float64
 8   PPTUG_EF        55491 non-null  float64
 9   SAT_AVG_ALL     32424 non-null  float64
 10  COSTT4_A        27970 non-null  float64
 11  CONTROL         58119 non-null  object
 12  TUITIONFEE_IN   48634 non-null  float64
 13  TUITIONFEE_OUT  47855 non-null  float64
 14  UGDS_WHITE      34930 non-null  float64
 15  UGDS_BLACK      34930 non-null  float64
 16  UGDS_HISP       34930 non-null  float64
 17  UGDS_ASIAN      34930 non-null  float64
 18  UGDS_AIAN       34930 non-null  float64
 19  UGDS_NHPI       34930 non-null  float64
 20  UGDS_2MOR       34930 non-null  float64
 21  UGDS_NRA        55613 non-null  float64
 22  UGDS_UNKN       55613 non-null  float64
 23  year            58123 non-null  int64
dtypes: float64(15), int64(2), object(7)
memory usage: 10.6+ MB

In [27]:
df2.isnull().sum()

UNITID                0
INSTNM                0
CITY                  0
STABBR                0
ZIP                   0
REGION                1
PREDDEG               0
ADM_RATE_ALL          0
PPTUG_EF           2632
SAT_AVG_ALL       25699
COSTT4_A          30153
CONTROL               4
TUITIONFEE_IN      9489
TUITIONFEE_OUT    10268
UGDS_WHITE        23193
UGDS_BLACK        23193
UGDS_HISP         23193
UGDS_ASIAN        23193
UGDS_AIAN         23193
UGDS_NHPI         23193
UGDS_2MOR         23193
UGDS_NRA           2510
UGDS_UNKN          2510
year                  0
dtype: int64

In [28]:
df2['UGDS_BLACK'].unique()

array([   nan, 0.    , 0.9776, ..., 0.4978, 0.3167, 0.1411])

In [29]:
second_drop = ['UGDS_WHITE','UGDS_BLACK', 'UGDS_HISP', 'UGDS_ASIAN', 'UGDS_AIAN', 'UGDS_NHPI',
       'UGDS_2MOR', 'UGDS_NRA', 'UGDS_UNKN',]
df3 = df2.drop(second_drop, axis=1)

In [30]:
df3.head()

,UNITID,INSTNM,CITY,STABBR,ZIP,REGION,PREDDEG,ADM_RATE_ALL,PPTUG_EF,SAT_AVG_ALL,COSTT4_A,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year
0,100654,Alabama A & M University,Normal,AL,35762,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7505,0.0764,970.0,NaN,Public,4664.0,5200.0,2001
1,100663,University of Alabama at Birmingham,Birmingham,AL,35294-0110,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.9098,0.2801,1030.0,NaN,Public,3640.0,6610.0,2001
2,100706,University of Alabama in Huntsville,Huntsville,AL,35899,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.8381,0.2689,1109.0,NaN,Public,3536.0,7430.0,2001
3,100751,The University of Alabama,Tuscaloosa,AL,35487-0100,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7948,0.0982,1091.0,NaN,Public,3292.0,8912.0,2001
4,100858,Auburn University,Auburn,AL,36849,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7594,0.0906,1094.0,NaN,Public,3380.0,9900.0,2001

In [31]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58123 entries, 0 to 58122
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   UNITID          58123 non-null  int64
 1   INSTNM          58123 non-null  object
 2   CITY            58123 non-null  object
 3   STABBR          58123 non-null  object
 4   ZIP             58123 non-null  object
 5   REGION          58122 non-null  object
 6   PREDDEG         58123 non-null  object
 7   ADM_RATE_ALL    58123 non-null  float64
 8   PPTUG_EF        55491 non-null  float64
 9   SAT_AVG_ALL     32424 non-null  float64
 10  COSTT4_A        27970 non-null  float64
 11  CONTROL         58119 non-null  object
 12  TUITIONFEE_IN   48634 non-null  float64
 13  TUITIONFEE_OUT  47855 non-null  float64
 14  year            58123 non-null  int64
dtypes: float64(6), int64(2), object(7)
memory usage: 6.7+ MB

In [32]:
df3.isnull().sum()

UNITID                0
INSTNM                0
CITY                  0
STABBR                0
ZIP                   0
REGION                1
PREDDEG               0
ADM_RATE_ALL          0
PPTUG_EF           2632
SAT_AVG_ALL       25699
COSTT4_A          30153
CONTROL               4
TUITIONFEE_IN      9489
TUITIONFEE_OUT    10268
year                  0
dtype: int64

In [33]:
# drop missing rows from the region and control columns
df4 = df3.dropna(subset=['REGION', 'CONTROL'])

In [34]:
df4.isnull().sum()

UNITID                0
INSTNM                0
CITY                  0
STABBR                0
ZIP                   0
REGION                0
PREDDEG               0
ADM_RATE_ALL          0
PPTUG_EF           2627
SAT_AVG_ALL       25696
COSTT4_A          30148
CONTROL               0
TUITIONFEE_IN      9486
TUITIONFEE_OUT    10263
year                  0
dtype: int64

In [35]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 58118 entries, 0 to 58122
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   UNITID          58118 non-null  int64
 1   INSTNM          58118 non-null  object
 2   CITY            58118 non-null  object
 3   STABBR          58118 non-null  object
 4   ZIP             58118 non-null  object
 5   REGION          58118 non-null  object
 6   PREDDEG         58118 non-null  object
 7   ADM_RATE_ALL    58118 non-null  float64
 8   PPTUG_EF        55491 non-null  float64
 9   SAT_AVG_ALL     32422 non-null  float64
 10  COSTT4_A        27970 non-null  float64
 11  CONTROL         58118 non-null  object
 12  TUITIONFEE_IN   48632 non-null  float64
 13  TUITIONFEE_OUT  47855 non-null  float64
 14  year            58118 non-null  int64
dtypes: float64(6), int64(2), object(7)
memory usage: 7.1+ MB

In [36]:
# Replacing missing values of PPTUG_EF with the mean
mean_pptug = df4['PPTUG_EF'].mean()
mean_pptug

0.15750906993926944

In [37]:
df5 = df4.copy()

In [38]:
df5['PPTUG_EF'] = df4['PPTUG_EF'].fillna(mean_pptug)

In [39]:
df5.isnull().sum()

UNITID                0
INSTNM                0
CITY                  0
STABBR                0
ZIP                   0
REGION                0
PREDDEG               0
ADM_RATE_ALL          0
PPTUG_EF              0
SAT_AVG_ALL       25696
COSTT4_A          30148
CONTROL               0
TUITIONFEE_IN      9486
TUITIONFEE_OUT    10263
year                  0
dtype: int64

In [40]:
# Replacing missing values of TUITIONFEE_IN with the mean
df6 = df5.copy()
mean_in = df6['TUITIONFEE_IN'].mean()
df6['TUITIONFEE_IN'] = df6['TUITIONFEE_IN'].fillna(mean_in)

In [41]:
# Replacing missing values of TUITIONFEE_OUT with the mean
df7 = df6.copy()
mean_out = df6['TUITIONFEE_OUT'].mean()
df7['TUITIONFEE_OUT'] = df6['TUITIONFEE_OUT'].fillna(mean_out)

In [42]:
df7.isnull().sum()

UNITID                0
INSTNM                0
CITY                  0
STABBR                0
ZIP                   0
REGION                0
PREDDEG               0
ADM_RATE_ALL          0
PPTUG_EF              0
SAT_AVG_ALL       25696
COSTT4_A          30148
CONTROL               0
TUITIONFEE_IN         0
TUITIONFEE_OUT        0
year                  0
dtype: int64

In [43]:
# See the various institutions
df7['INSTNM'].unique()

array(['Alabama A & M University', 'University of Alabama at Birmingham',
       'University of Alabama in Huntsville', ...,
       'Washington State University - Everett Campus',
       'Jersey College - Fort Wayne', 'MAK Beauty Institute - Duluth'],
      dtype=object)

In [44]:
df7['INSTNM'].nunique()

4868

In [45]:
# Getting rid of all missing values
df8 = df7.dropna()

In [46]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18663 entries, 24197 to 57945
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   UNITID          18663 non-null  int64
 1   INSTNM          18663 non-null  object
 2   CITY            18663 non-null  object
 3   STABBR          18663 non-null  object
 4   ZIP             18663 non-null  object
 5   REGION          18663 non-null  object
 6   PREDDEG         18663 non-null  object
 7   ADM_RATE_ALL    18663 non-null  float64
 8   PPTUG_EF        18663 non-null  float64
 9   SAT_AVG_ALL     18663 non-null  float64
 10  COSTT4_A        18663 non-null  float64
 11  CONTROL         18663 non-null  object
 12  TUITIONFEE_IN   18663 non-null  float64
 13  TUITIONFEE_OUT  18663 non-null  float64
 14  year            18663 non-null  int64
dtypes: float64(6), int64(2), object(7)
memory usage: 2.3+ MB

In [47]:
# Check the number of universities lost in the cleaning
df8['INSTNM'].nunique()

1676

In [48]:
# Creating a new dataframe without SAT_AVG_ALL, COSTT4_A 
df9 = df7.drop(['SAT_AVG_ALL', 'COSTT4_A'], axis=1)

In [49]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
Index: 58118 entries, 0 to 58122
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   UNITID          58118 non-null  int64
 1   INSTNM          58118 non-null  object
 2   CITY            58118 non-null  object
 3   STABBR          58118 non-null  object
 4   ZIP             58118 non-null  object
 5   REGION          58118 non-null  object
 6   PREDDEG         58118 non-null  object
 7   ADM_RATE_ALL    58118 non-null  float64
 8   PPTUG_EF        58118 non-null  float64
 9   CONTROL         58118 non-null  object
 10  TUITIONFEE_IN   58118 non-null  float64
 11  TUITIONFEE_OUT  58118 non-null  float64
 12  year            58118 non-null  int64
dtypes: float64(4), int64(2), object(7)
memory usage: 6.2+ MB

### Questions
1. What school has the highest tuition from 2017 - 2022
2. What region has the highest amount of institutions
3. How many Public schools are there in the southwest region 
4. How many private schools are in the southeast region as at 2022
5. Which school has the highest share of part-time students between 2017 - 2022

In [50]:
df9.head()

,UNITID,INSTNM,CITY,STABBR,ZIP,REGION,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year
0,100654,Alabama A & M University,Normal,AL,35762,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7505,0.0764,Public,4664.0,5200.0,2001
1,100663,University of Alabama at Birmingham,Birmingham,AL,35294-0110,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.9098,0.2801,Public,3640.0,6610.0,2001
2,100706,University of Alabama in Huntsville,Huntsville,AL,35899,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.8381,0.2689,Public,3536.0,7430.0,2001
3,100751,The University of Alabama,Tuscaloosa,AL,35487-0100,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7948,0.0982,Public,3292.0,8912.0,2001
4,100858,Auburn University,Auburn,AL,36849,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7594,0.0906,Public,3380.0,9900.0,2001

### Transforming data

In [51]:
# Get rid of the zip code and UnitID columns
df10 = df9.drop(['UNITID', 'ZIP'], axis=1)

In [52]:
df10.head()

,INSTNM,CITY,STABBR,REGION,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year
0,Alabama A & M University,Normal,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7505,0.0764,Public,4664.0,5200.0,2001
1,University of Alabama at Birmingham,Birmingham,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.9098,0.2801,Public,3640.0,6610.0,2001
2,University of Alabama in Huntsville,Huntsville,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.8381,0.2689,Public,3536.0,7430.0,2001
3,The University of Alabama,Tuscaloosa,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7948,0.0982,Public,3292.0,8912.0,2001
4,Auburn University,Auburn,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.7594,0.0906,Public,3380.0,9900.0,2001

In [53]:
df10['REGION'].unique()

array(['Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC, TN, VA, WV)',
       'Far West (AK, CA, HI, NV, OR, WA)', 'Southwest (AZ, NM, OK, TX)',
       'Rocky Mountains (CO, ID, MT, UT, WY)', 'U.S. Service Schools',
       'New England (CT, ME, MA, NH, RI, VT)',
       'Mid East (DE, DC, MD, NJ, NY, PA)',
       'Great Lakes (IL, IN, MI, OH, WI)',
       'Plains (IA, KS, MN, MO, NE, ND, SD)',
       'Outlying Areas (AS, FM, GU, MH, MP, PR, PW, VI)'], dtype=object)

In [58]:
'Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC, TN, VA, WV)'.split('(')

['Southeast ', 'AL, AR, FL, GA, KY, LA, MS, NC, SC, TN, VA, WV)']

In [55]:
"How are you doing? Hope you are good?".split('?')

['How are you doing', ' Hope you are good', '']

In [56]:
# Extract the Regions
df10['Only Region'] = df10['REGION'].apply(lambda x: x.split('(')[0])

In [67]:
df10

,INSTNM,CITY,STABBR,REGION,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year,Only Region
0,Alabama A & M University,Normal,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.750500,0.076400,Public,4664.000000,5200.000000,2001,Southeast
1,University of Alabama at Birmingham,Birmingham,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.909800,0.280100,Public,3640.000000,6610.000000,2001,Southeast
2,University of Alabama in Huntsville,Huntsville,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.838100,0.268900,Public,3536.000000,7430.000000,2001,Southeast
3,The University of Alabama,Tuscaloosa,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.794800,0.098200,Public,3292.000000,8912.000000,2001,Southeast
4,Auburn University,Auburn,AL,"Southeast (AL, AR, FL, GA, KY, LA, MS, NC, SC,...",Predominantly bachelor's-degree granting,0.759400,0.090600,Public,3380.000000,9900.000000,2001,Southeast
...,...,...,...,...,...,...,...,...,...,...,...,...
58118,Pennsylvania State University-Penn State Wilke...,Lehman,PA,"Mid East (DE, DC, MD, NJ, NY, PA)",Not classified,0.922647,0.157509,Public,13936.000000,22798.000000,2022,Mid East
58119,Pennsylvania State University-Penn State York,York,PA,"Mid East (DE, DC, MD, NJ, NY, PA)",Not classified,0.922647,0.157509,Public,14838.000000,24110.000000,2022,Mid East
58120,Pennsylvania State University-Penn State Great...,Malvern,PA,"Mid East (DE, DC, MD, NJ, NY, PA)",Not classified,0.922647,0.157509,Public,17326.133081,19962.788737,2022,Mid East
58121,Pennsylvania State University-Penn State Harri...,Middletown,PA,"Mid East (DE, DC, MD, NJ, NY, PA)",Not classified,0.922647,0.157509,Public,15586.000000,25600.000000,2022,Mid East
58122,Pennsylvania State University-Penn State Brand...,Media,PA,"Mid East (DE, DC, MD, NJ, NY, PA)",Not classified,0.922647,0.157509,Public,14838.000000,24110.000000,2022,Mid East

In [62]:
X = 'Far West (AK, CA, HI, NV, OR, WA)'.split('(')

In [63]:
len(X)

2

In [66]:
X[1]

'AK, CA, HI, NV, OR, WA)'

In [68]:
df10['Only Region'].unique()

array(['Southeast ', 'Far West ', 'Southwest ', 'Rocky Mountains ',
       'U.S. Service Schools', 'New England ', 'Mid East ',
       'Great Lakes ', 'Plains ', 'Outlying Areas '], dtype=object)

In [69]:
df11 =df10.drop('REGION', axis=1)

In [71]:
df11.head(2)

,INSTNM,CITY,STABBR,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year,Only Region
0,Alabama A & M University,Normal,AL,Predominantly bachelor's-degree granting,0.7505,0.0764,Public,4664.0,5200.0,2001,Southeast
1,University of Alabama at Birmingham,Birmingham,AL,Predominantly bachelor's-degree granting,0.9098,0.2801,Public,3640.0,6610.0,2001,Southeast

In [134]:
df11['Only Region'].str.strip(' ')

0        Southeast
1        Southeast
2        Southeast
3        Southeast
4        Southeast
           ...
58118     Mid East
58119     Mid East
58120     Mid East
58121     Mid East
58122     Mid East
Name: Only Region, Length: 58118, dtype: object

In [135]:
# Question 1
data_2017_2022 = df11[df11['year'] >= 2017]

In [136]:
data_2017_2022.head()

,INSTNM,CITY,STABBR,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year,Only Region
44708,Alabama A & M University,Normal,AL,Predominantly bachelor's-degree granting,0.9027,0.0655,Public,9857.0,18236.0,2017,Southeast
44709,University of Alabama at Birmingham,Birmingham,AL,Predominantly bachelor's-degree granting,0.9181,0.2515,Public,8328.0,19032.0,2017,Southeast
44710,University of Alabama in Huntsville,Huntsville,AL,Predominantly bachelor's-degree granting,0.8123,0.1496,Public,10280.0,21480.0,2017,Southeast
44711,Alabama State University,Montgomery,AL,Predominantly bachelor's-degree granting,0.9787,0.0771,Public,11068.0,19396.0,2017,Southeast
44712,The University of Alabama,Tuscaloosa,AL,Predominantly bachelor's-degree granting,0.5330,0.0792,Public,10780.0,28100.0,2017,Southeast

In [137]:
data_2017_2022.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13415 entries, 44708 to 58122
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   INSTNM          13415 non-null  object
 1   CITY            13415 non-null  object
 2   STABBR          13415 non-null  object
 3   PREDDEG         13415 non-null  object
 4   ADM_RATE_ALL    13415 non-null  float64
 5   PPTUG_EF        13415 non-null  float64
 6   CONTROL         13415 non-null  object
 7   TUITIONFEE_IN   13415 non-null  float64
 8   TUITIONFEE_OUT  13415 non-null  float64
 9   year            13415 non-null  int64
 10  Only Region     13415 non-null  object
dtypes: float64(4), int64(1), object(6)
memory usage: 1.2+ MB

In [138]:
institution = data_2017_2022.groupby('INSTNM')

In [139]:
# Get the average tuition fee_in from 2017 - 2022
institution[['TUITIONFEE_IN']].mean().sort_values(by='TUITIONFEE_IN', ascending=False).head(1)

                                             TUITIONFEE_IN
INSTNM
Columbia University in the City of New York   61192.833333

In [140]:
institution[['TUITIONFEE_OUT']].mean().sort_values(by='TUITIONFEE_OUT', ascending=False).head(1)

                                             TUITIONFEE_OUT
INSTNM
Columbia University in the City of New York    61192.833333

In [141]:
# Question 2
region = df11.groupby('Only Region')

In [142]:
region['INSTNM'].nunique().sort_values(ascending=False)

Only Region
Southeast               1130
Mid East                 907
Great Lakes              770
Far West                 673
Southwest                435
Plains                   417
New England              315
Rocky Mountains          146
Outlying Areas           119
U.S. Service Schools       5
Name: INSTNM, dtype: int64

In [145]:
# Question 3
south_west = region.get_group('Southwest ')

In [146]:
type(south_west)

pandas.core.frame.DataFrame

In [148]:
south_west.head()

,INSTNM,CITY,STABBR,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year,Only Region
31,Everest College-Phoenix,Phoenix,AZ,Predominantly associate's-degree granting,0.8989,0.0000,Private for-profit,18920.000000,18920.000000,2001,Southwest
32,Collins College,Phoenix,AZ,Predominantly associate's-degree granting,0.5030,0.0000,Private for-profit,17326.133081,19962.788737,2001,Southwest
33,American Indian College Inc,Phoenix,AZ,Predominantly bachelor's-degree granting,0.4444,0.1613,Private nonprofit,4330.000000,4330.000000,2001,Southwest
34,American Institute of Trucking,Phoenix,AZ,Predominantly certificate-degree granting,0.7143,0.0000,Private for-profit,17326.133081,19962.788737,2001,Southwest
35,Carrington College-Phoenix North,Phoenix,AZ,Predominantly certificate-degree granting,0.8327,0.0000,Private for-profit,17326.133081,19962.788737,2001,Southwest

In [150]:
south_west['CONTROL'].unique()

array(['Private for-profit', 'Private nonprofit', 'Public'], dtype=object)

In [152]:
southwest_public = south_west[south_west['CONTROL']=='Public']

In [153]:
southwest_public['INSTNM'].nunique()

107

In [154]:
# Question 4
south_east = region.get_group('Southeast ')

In [156]:
south_east.head()

,INSTNM,CITY,STABBR,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year,Only Region
0,Alabama A & M University,Normal,AL,Predominantly bachelor's-degree granting,0.7505,0.0764,Public,4664.0,5200.0,2001,Southeast
1,University of Alabama at Birmingham,Birmingham,AL,Predominantly bachelor's-degree granting,0.9098,0.2801,Public,3640.0,6610.0,2001,Southeast
2,University of Alabama in Huntsville,Huntsville,AL,Predominantly bachelor's-degree granting,0.8381,0.2689,Public,3536.0,7430.0,2001,Southeast
3,The University of Alabama,Tuscaloosa,AL,Predominantly bachelor's-degree granting,0.7948,0.0982,Public,3292.0,8912.0,2001,Southeast
4,Auburn University,Auburn,AL,Predominantly bachelor's-degree granting,0.7594,0.0906,Public,3380.0,9900.0,2001,Southeast

In [157]:
# select only rows with the year 2022
south_east_2022 = south_east[south_east['year']==2022]

In [159]:
south_east_2022.count()

INSTNM            518
CITY              518
STABBR            518
PREDDEG           518
ADM_RATE_ALL      518
PPTUG_EF          518
CONTROL           518
TUITIONFEE_IN     518
TUITIONFEE_OUT    518
year              518
Only Region       518
dtype: int64

In [166]:
# select only rows with control = 
south_east_2022_private = south_east_2022[(south_east_2022['CONTROL']== 'Private for-profit') |\
                                         (south_east_2022['CONTROL'] == 'Private nonprofit')]

In [167]:
south_east_2022_private['INSTNM'].nunique()

345

In [168]:
# Question 5
institution_2017_2022 = data_2017_2022.groupby('INSTNM')

In [169]:
data_2017_2022.head()

,INSTNM,CITY,STABBR,PREDDEG,ADM_RATE_ALL,PPTUG_EF,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,year,Only Region
44708,Alabama A & M University,Normal,AL,Predominantly bachelor's-degree granting,0.9027,0.0655,Public,9857.0,18236.0,2017,Southeast
44709,University of Alabama at Birmingham,Birmingham,AL,Predominantly bachelor's-degree granting,0.9181,0.2515,Public,8328.0,19032.0,2017,Southeast
44710,University of Alabama in Huntsville,Huntsville,AL,Predominantly bachelor's-degree granting,0.8123,0.1496,Public,10280.0,21480.0,2017,Southeast
44711,Alabama State University,Montgomery,AL,Predominantly bachelor's-degree granting,0.9787,0.0771,Public,11068.0,19396.0,2017,Southeast
44712,The University of Alabama,Tuscaloosa,AL,Predominantly bachelor's-degree granting,0.5330,0.0792,Public,10780.0,28100.0,2017,Southeast

In [177]:
# Average proportion from 2017 - 2022
institution_2017_2022[['PPTUG_EF']].mean().sort_values(by='PPTUG_EF', ascending=False).head(15)

                                                    PPTUG_EF
INSTNM
Vista Adult School                                       1.0
Bancroft School of Massage Therapy                       1.0
LIU Brentwood                                            1.0
Amslee Institute                                         1.0
Motion Picture Institute                                 1.0
Dental Assistant Pro LLC-Columbus                        1.0
Poway Adult School                                       1.0
Indiana Wellness College                                 1.0
Dental Assistant Pro-Lebanon                             1.0
Mauna Loa Helicopters                                    1.0
California Career Institute                              1.0
Elizabethtown College School of Continuing and ...       1.0
Escondido Adult School                                   1.0
European Massage Therapy School-Las Vegas                1.0
Montefiore School of Nursing                             1.0